### Terraform `plan` Succeeded for Workspace: `dev`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # kubernetes_storage_class_v1.efs[0] must be replaced
-/+ resource "kubernetes_storage_class_v1" "efs" {
!       id                     = "jingood2-dev-efs" -> (known after apply)
-       mount_options          = [] -> null
!       parameters             = { # forces replacement
+           "provisioningMode" = "efs-ap"
-           "type"             = "efs-ap" -> null
            # (2 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

!       metadata {
-           annotations      = {} -> null
!           generation       = 0 -> (known after apply)
-           labels           = {} -> null
            name             = "jingood2-dev-efs"
!           resource_version = "4022" -> (known after apply)
!           uid              = "eb82e6bd-4cc6-405e-9107-13b8312926e5" -> (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
</details>